type FaqItem = {
  question: string;
  answer: string;
};

export const LINKS = {
  telegram: "https://t.me/hackathon_aot",
  vk: "https://vk.ru/hackathon_urfu",
  form: "https://forms.yandex.ru/u/6ab919a402848fef36020c9a",
};

export const FAQ_LIST: FaqItem[] = [
  {
    question: "ЧТО ДЕЛАТЬ, ЕСЛИ ВОЗНИКЛИ ПРОБЛЕМЫ С РЕГИСТРАЦИЕЙ?",
    answer:
      "Проверьте корректность введенных данных. Если проблема сохраняется - свяжитесь с организаторами.",
  },
  {
    question: "КАК Я МОГУ ОПЕРАТИВНО ПОЛУЧАТЬ НОВОСТИ И ОБНОВЛЕНИЯ?",
    answer:
      "Все актуальные новости, анонсы и инструкции публикуются в официальном Telegram-канале хакатона, а также на странице ВКонтакте. Рекомендуем подписаться, чтобы не пропустить важную информацию.",
  },
  {
    question: "НУЖНО ЛИ УЧАСТВОВАТЬ В ХАКАТОНЕ ОФЛАЙН ВСЕ 24 ЧАСА?",
    answer:
      "Нет. Формат участия гибкий.Вы можете самостоятельно распределять время работы над проектом, однако присутствие на ключевых этапах (открытие, защита проектов) обязательно.",
  },
  {
    question: "МОЖНО ЛИ УЧАСТВОВАТЬ БЕЗ КОМАНДЫ?",
    answer:
      "Да, Вы можете зарегистрироваться индивидуально. Организаторы помогут найти команду до начала хакатона.",
  },
  {
    question: "КАКИЕ ТРЕБОВАНИЯ К УЧАСТНИКАМ?",
    answer:
      "К участию приглашаются студенты и начинающие специалисты от 18 лет, интересующиеся разработкой проектов в сфере IT и цифровой инженерии.",
  },
  {
    question: "ЧТО ПОЛУЧАТ УЧАСТНИКИ ПО ИТОГАМ ХАКАТОНА?",
    answer:
      "Участники получат опыт работы над реальными кейсами, обратную связь от экспертов, дипломы и ценные призы",
  },
];

export const STAGES = [
  {
    date: "28 ОКТЯБРЯ – 25 НОЯБРЯ",
    mode: "online",
    title: "РЕГИСТРАЦИЯ УЧАСТНИКОВ",
    description: "Оставьте заявку на странице, чтобы стать участником хакатона",
  },
  {
    date: "28 НОЯБРЯ",
    mode: "offline",
    title: "ПОДГОТОВКА И ОБУЧЕНИЕ",
    description:
      "Приходите на воркшоп, чтобы глубже понять индустрию и задачи хакатона",
  },
  {
    date: "25–29 НОЯБРЯ",
    mode: "online",
    title: "ОТБОРОЧНЫЙ ЭТАП",
    description:
      "Решение тестового задания, по результатам которого лучшие команды будут решать кейсы от компаний-партнеров",
  },
  {
    date: "5 ДЕКАБРЯ",
    mode: "offline",
    title: "СТАРТ ХАКАТОНА И ПРЕЗЕНТАЦИЯ КЕЙСОВ",
    description: "Перед началом хакатона мы подробно расскажем о каждом кейсе",
  },
] as const;

export const STEPS = [
  {
    step: "01",
    title: "ЗАПОЛНИТЕ АНКЕТУ",
    description: "Зарегистрируйся до 25.11.2026 23:59 Екб",
    link: LINKS.form,
  },
  {
    step: "02",
    title: "ВСТУПИТЕ В НАШУ ГРУППУ В TELEGRAM",
    description: undefined,
    link: LINKS.telegram,
  },
  {
    step: "03",
    title: "ЖДИТЕ СТАРТА",
    description:
      "Детали и инструкции придут на указанные при регистрации контакты",
    link: undefined,
  },
] as const;
